app/Models/PeriodYearModel.php

	public function getData()
	{
		$this->select('*');
		return $this->get();
---
SELECT *
FROM `tbl_period_year`